ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble.c
/***************************************************************************//**
* \file cy_ble.c
* \version 2.0
*
* \brief
*  This file contains the source code for the API of the BLE Component.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"
#include "cy_ble_hal_pvt.h"
#include "cy_ipc_config.h"
#include <stdlib.h>

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_HOST_CONTR_CORE)


/***************************************
* Global Variables
***************************************/

/* Allocate RAM memory for the stack. This buffer can be reused by the application when
 * the BLE Component is stopped. For the export mode, the buffer is allocated in a heap.
 */
#if (CY_BLE_SHARING_MODE_EXPORT)
uint8_t *cy_ble_stackMemoryRam = NULL;
#else
CY_ALIGN(sizeof(uint32_t)) CY_NOINIT uint8_t cy_ble_stackMemoryRam[CY_BLE_STACK_RAM_SIZE];
#endif  /* CY_BLE_SHARING_MODE_EXPORT */

#if (CY_BLE_MODE_PROFILE)
cy_ble_callback_t Cy_BLE_ApplCallback;
#endif  /* (CY_BLE_MODE_PROFILE) */

/* Pointer to the global BLE Config structures */
cy_stc_ble_config_t *cy_ble_configPtr = NULL;


#if (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u)
  /* Structure with the syspm callback parameters for BLE deep-sleep */
  static cy_stc_syspm_callback_params_t bleDeepSleepCallbackParams = { .base = NULL};
  static cy_stc_syspm_callback_t bleDeepSleepCallback =
  {
    .callback = &Cy_BLE_DeepSleepCallback,
    .type = CY_SYSPM_DEEPSLEEP,
    .skipMode = CY_SYSPM_SKIP_BEFORE_TRANSITION | CY_SYSPM_SKIP_CHECK_FAIL,
    .callbackParams = &bleDeepSleepCallbackParams
  };


  /* Structure with the syspm callback parameters for BLE sleep */
#if(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC)
  static cy_stc_syspm_callback_params_t bleSleepCallbackParams = { .base = NULL};
  static cy_stc_syspm_callback_t bleSleepCallback =
  {
    .callback = &Cy_BLE_SleepCallback,
    .type = CY_SYSPM_SLEEP,
    .skipMode = CY_SYSPM_SKIP_BEFORE_TRANSITION | CY_SYSPM_SKIP_CHECK_FAIL,
    .callbackParams = &bleSleepCallbackParams
  };
#endif /* (CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC) */
#endif  /* (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u) */


/******************************************************************************
* Function Name: Cy_BLE_UnregisterHostPMCallbacks
***************************************************************************//**
*
*  Unregister BLE callback for Deepsleep/Sleep
*
******************************************************************************/
void Cy_BLE_UnregisterHostPMCallbacks(void)
{
    #if (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u)
    /* Unregister BLE callback for Deepsleep support */
    (void)Cy_SysPm_UnregisterCallback(&bleDeepSleepCallback);
    
    /* Unregister sleep mode callback only in dual core mode for the host core */
    #if(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC)
    {
        /* Unregister BLE callback for Sleep support */
        (void)Cy_SysPm_UnregisterCallback(&bleSleepCallback);
    }
    #endif /* (CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC) */
    #endif /* (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u) */
}

/**
 * \addtogroup group_ble_common_api_functions
 * @{
 */

/******************************************************************************
* Function Name: Cy_BLE_Init
***************************************************************************//**
*
*  Initializes the Component with the parameters set in the customizer.
*
*  \param config: The configuration structure for the BLE Component.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error codes                        | Description
*   ------------                       | -----------
*   CY_BLE_SUCCESS                     | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER     | On specifying NULL as the input parameter.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_Init(cy_stc_ble_config_t *config)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
    #if (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u)
        /* Register BLE callback for Deepsleep support */
        (void)Cy_SysPm_RegisterCallback(&bleDeepSleepCallback);
        
        /* Register sleep mode callback only in dual core mode for the host core */
        #if(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC)
        {
            /* Register BLE callback for Sleep support */
            (void)Cy_SysPm_RegisterCallback(&bleSleepCallback);
        }
        #endif /* (CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC) */
    #endif  /* (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u) */

        /* Register a pointer to the config structure */
        cy_ble_configPtr = config;

    #if (CY_BLE_MODE_PROFILE)
        /* Register a callback function via the config structure */
        if(cy_ble_configPtr->callbackFunc != NULL)
        {
            Cy_BLE_ApplCallback = cy_ble_configPtr->callbackFunc;
        }
        cy_ble_eventHandlerFlag = 0u;
        (void)memset((uint8_t*)&cy_ble_busyStatus, 0, sizeof(cy_ble_busyStatus));

        cy_ble_cmdStatus = 0u;
        
        #if (CY_BLE_GATT_ROLE_CLIENT)
        {
            uint32_t idx;
            (void)memset(&cy_ble_serverInfo, 0, sizeof(cy_ble_serverInfo));
            (void)memset(cy_ble_connHandle, -1, sizeof(cy_ble_connHandle));
            (void)memset(&cy_ble_discovery, 0, sizeof(cy_ble_discovery));

            /* Update cy_ble_discovery[].connIndex with init values (CY_BLE_INVALID_CONN_HANDLE_VALUE) */
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                cy_ble_discovery[idx].connIndex = CY_BLE_INVALID_CONN_HANDLE_VALUE;
            }
        }
        #endif /* CY_BLE_GATT_ROLE_CLIENT */

        #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
        cy_ble_advertisingIntervalType = CY_BLE_ADVERTISING_FAST;
        #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)  */

        #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
        cy_ble_scanningIntervalType = CY_BLE_SCANNING_FAST;
        #endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER) */

