ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble.c
        Cy_BLE_ServiceInit();

        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
        cy_ble_pendingFlashWrite = 0u;
        (void)memset(cy_ble_peerBonding, (int8_t)CY_BLE_GAP_BONDING_NONE, sizeof(cy_ble_peerBonding));
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
    #endif     /* (CY_BLE_MODE_PROFILE) */
    }

    return(apiResult);
}
/** @} */

/******************************************************************************
* Function Name: Cy_BLE_Enable
***************************************************************************//**
*
*  Initializes and starts the Host stack.
*  Calling this function results in generation of a CY_BLE_EVT_STACK_ON event
*  on successful initialization of the BLE stack.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error codes                       | Description
*   ------------                      | -----------
*   CY_BLE_SUCCESS                    | The function completed successfully.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_Enable(void)
{
    cy_en_ble_api_result_t apiResult;

#if (CY_BLE_MODE_PROFILE)
    cy_stc_ble_stk_app_data_buff_t cy_ble_stackDataBuff[CY_BLE_STACK_APP_MIN_POOL] =
    {
        { CY_BLE_GATT_MTU_PLUS_L2CAP_MEM_EXT,   CY_BLE_GATT_MTU_BUFF_COUNT              },
        { CY_BLE_L2CAP_PSM_PLUS_L2CAP_MEM_EXT,  CY_BLE_L2CAP_PSM_COUNT                  },
        { CY_BLE_L2CAP_CBFC_PLUS_L2CAP_MEM_EXT, 2u * CY_BLE_L2CAP_LOGICAL_CHANNEL_COUNT },
        { CY_BLE_L2CAP_MTU_PLUS_L2CAP_MEM_EXT,  2u * CY_BLE_L2CAP_LOGICAL_CHANNEL_COUNT }
    };
#endif  /* (CY_BLE_MODE_PROFILE) */

    cy_stc_ble_stack_init_info_t stackInitParam =
    {
        #if (CY_BLE_MODE_PROFILE)
        .CyBleAppCbFunc                      = (cy_ble_app_ev_cb_t)&Cy_BLE_EventHandler,
        #endif /* CY_BLE_MODE_PROFILE */
        .memParam                            =
        {
        #if (CY_BLE_MODE_PROFILE)
            .totalHeapSz                     = (uint16_t)(CY_BLE_STACK_RAM_SIZE - CY_BLE_GATT_PREPARE_WRITE_BUFF_LEN),
            .dataBuff                        = cy_ble_stackDataBuff,
            .totalDataBufferPools            = CY_BLE_STACK_APP_MIN_POOL,

            #if (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES)
            .bleStackFlashPointer            = (const uint8_t*)cy_ble_configPtr->flashStorage->stackFlashptr,
            .bleStackFlashSize               = CY_BLE_STACK_FLASH_SIZE,
            #endif  /* CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES */
        #else
            .totalHeapSz                     = CY_BLE_STACK_RAM_SIZE,
        #endif /* CY_BLE_MODE_PROFILE */
        },
        .stackConfig                         =
        {
            /* Configure DLE */
            .dleConfig.dleMaxTxCapability    = CY_BLE_LL_MAX_TX_PAYLOAD_SIZE,
            .dleConfig.dleMaxRxCapability    = CY_BLE_LL_MAX_RX_PAYLOAD_SIZE,
            .dleConfig.dleNumTxBuffer        = CY_BLE_LL_DEFAULT_NUM_ACL_TX_PACKETS,
            .dleConfig.dleNumRxBuffer        = CY_BLE_LL_DEFAULT_NUM_ACL_RX_PACKETS,

        #if (CY_BLE_MODE_PROFILE)
            /* Configure queue */
            .l2capConfig.l2capBufferPerConn  = CY_BLE_L2CAP_Q_DEPTH_PER_CONN,
        #endif /* (CY_BLE_MODE_PROFILE) */

            /* Configure LL Privacy */
            .privacyConfig.resolvingListSize = CY_BLE_MAX_RESOLVABLE_DEVICES,

            /* Configure bonded device list  */
            .bondListConfig.bondListSize     = CY_BLE_MAX_BONDED_DEVICES,

            /* Configure white list */
            .whiteListConfig.whiteListSize   = CY_BLE_MAX_WHITE_LIST_SIZE,

            .featureMask                     = (CY_BLE_DLE_FEATURE | CY_BLE_LL_PRIVACY_FEATURE | CY_BLE_SECURE_CONN_FEATURE |
                                                CY_BLE_PHY_UPDATE_FEATURE | CY_BLE_STORE_BONDLIST_FEATURE |
                                                CY_BLE_STORE_RESOLVING_LIST_FEATURE | CY_BLE_STORE_WHITELIST_FEATURE | 
                                                CY_BLE_CONFIG_TX_POWER_CALIBRATION_FEATURE),
            .maxBleConnections               = CY_BLE_CONN_COUNT
        }
    };

    #if (CY_BLE_DLE_FEATURE_ENABLED)
    Cy_BLE_EnableDleFeature();              /* Enable DLE code in the stack */
    #endif /* CY_BLE_DLE_FEATURE_ENABLED */

    #if (CY_BLE_LL_PRIVACY_FEATURE_ENABLED)
    Cy_BLE_EnablePrivacyFeature();          /* Enable LL Privacy code in the stack */
    #endif /* CY_BLE_LL_PRIVACY_FEATURE_ENABLED */

    #if (CY_BLE_PHY_UPDATE_FEATURE_ENABLED)
    Cy_BLE_EnablePhyUpdateFeature();        /* Enable PHY Update code in the stack */
    #endif /* CY_BLE_PHY_UPDATE_FEATURE_ENABLED */

    apiResult = Cy_BLE_StackSetFeatureConfig(&stackInitParam.stackConfig);

    if(apiResult == CY_BLE_SUCCESS)
    {
        stackInitParam.memParam.memoryHeapPtr = cy_ble_stackMemoryRam;

        /* Initialize the BLE stack */
        apiResult = Cy_BLE_StackInit(&stackInitParam);

    #if (CY_BLE_MODE_PROFILE)
        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetState(CY_BLE_STATE_INITIALIZING);

        #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)
            (void)memset(&cy_ble_connState, 0, sizeof(cy_ble_connState));
        #endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL) */

        #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
            Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOPPED);
        #endif  /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

        #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
            Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_STOPPED);
        #endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER) */

        #if (CY_BLE_GATT_ROLE_SERVER)
            {
                cy_stc_ble_gatts_db_info_t dbInfoParam =
                {
                    .gattDbPtr          = (const cy_stc_ble_gatts_db_t*)cy_ble_configPtr->gattDB,
                    .gattDbTotalEntries = cy_ble_configPtr->params->gattDbIndexCount,
                    .gattDbMaxValue     = CY_BLE_CONFIG_GATT_DB_MAX_VALUE_LEN
                };

                apiResult = Cy_BLE_GATTS_DbRegister(&dbInfoParam);
            }
        #endif /* CY_BLE_GATT_ROLE_SERVER */
        }
    #endif /* (CY_BLE_MODE_PROFILE) */
    }

    return(apiResult);
}


