ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble.c
    return(retVal);
}

#if(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC)

    
/*******************************************************************************
* Function Name: Cy_BLE_SleepCallback
****************************************************************************//**
*
* This function requests the BLE stack to put the Host to Sleep mode.
*
* It is registered to the system power mode by Cy_SysPm_RegisterCallback()
* function with CY_SYSPM_SLEEP type. After registration it is called by
* Cy_SysPm_Sleep() function prior entering the core into the Sleep
* power mode.
*
* This function is available only when BLE low power mode is enabled in the
* Advanced tab of customizer.
*
* \param
* callbackParams  pointer to the structure with the syspm callback parameters
*                 callbackParams->mode - the callback mode, see description 
*                 of the cy_en_syspm_callback_mode_t type.
*
* \return
* * CY_SYSPM_SUCCESS  - Entered and exited from Sleep
* * CY_SYSPM_FAIL     - Sleep not entered.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_BLE_SleepCallback(cy_stc_syspm_callback_params_t *callbackParams)
{
    cy_en_syspm_status_t retVal;
    static uint32_t interruptState = 0u;
    /* Local variable to store the status of BLESS Hardware block */
    cy_en_ble_lp_mode_t sleepMode;

    #if(!(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC))
    cy_en_ble_api_result_t retIsControllerActive = Cy_BLE_IsControllerActive(CY_BLE_CONTROLLER_SLEEP_MODE_SLEEP);
    #endif /* !(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC) */   
    
    switch(callbackParams->mode)
    {
        case (CY_SYSPM_CHECK_READY):
            if((Cy_BLE_GetState() == CY_BLE_STATE_INITIALIZING)
            #if(!(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC))
                    && (retIsControllerActive == CY_BLE_SUCCESS)
            #endif /* !(CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC) */
              )
            {
                retVal = CY_SYSPM_FAIL;
            }
            else
            {
                
                /* Disable global interrupt to prevent changes from any other interrupt ISR */
                interruptState = Cy_SysLib_EnterCriticalSection();
                
                /* Put BLESS into Deep Sleep and check the return status */
                sleepMode = Cy_BLE_StackEnterLPM(CY_BLE_BLESS_DEEPSLEEP);
                
                /* Check if host is ready for sleep mode */
                if(sleepMode != CY_BLE_BLESS_DEEPSLEEP) 
                {
                    retVal = CY_SYSPM_FAIL;
                    /* Enable interrupts after failing check */
                    Cy_SysLib_ExitCriticalSection(interruptState);
                }
                else
                {
                    retVal = CY_SYSPM_SUCCESS;
                }
            }
            break;

        /* Enable interrupts after wakeup */
        case (CY_SYSPM_AFTER_TRANSITION):
            Cy_SysLib_ExitCriticalSection(interruptState);
            retVal = CY_SYSPM_SUCCESS;
            break;

        default:
            retVal = CY_SYSPM_FAIL;
            break;
    }

    return(retVal);
}

#endif /* (CY_BLE_STACK_MODE_HOST_UART || CY_BLE_STACK_MODE_HOST_IPC) */
#endif /* (CY_BLE_CONFIG_USE_DEEP_SLEEP != 0u) */

#endif /* (CY_BLE_HOST_CONTR_CORE) */

#ifdef __cplusplus
}
#endif /* __cplusplus */


/* [] END OF FILE */
